Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes
The DetailMarkAttributes class is the attributes class for detail marks.

Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes.MarkName
The detail mark name.

Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes.BoundingLine
Gets or sets the line type.
Tekla.Structures.Drawing.LineTypeAttributes

Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes.BoundaryShape
The detail mark boundary shape.

Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes.MarkSymbolColor


Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes.TrueMarkSymbolColor
The true color (rgb enabled) of the detail mark symbol.
Throws System.ArgumentOutOfRangeException: The get method will
throw if the inputColor is not supported (0-7, 120 for example).
You should use this function in a try-catch statement, since
non-supported colors are used in TeklaStructures, especially in
older models. Define your own catch logic (default color, error
message, etc) based on your use case.

Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes.MarkSymbolAttributes
The detail mark symbol attributes.

Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes.TagsAttributes
The attributes for detail mark tags.

Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes.BoundaryLineType
Deprecated, use BoundingLine instead

Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes.BoundaryLineColor
Deprecated, use BoundingLine instead

Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes.#ctor(System.Boolean)
Creates a new default DetailMarkAttributes instance that does not load standard attributes

Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes.#ctor
Creates a new default DetailMarkAttributes instance that loads standard attributes.

Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes.#ctor(System.String)
Creates a new DetailMarkAttributes instance that loads the specified attributes.
attributesFile: The attributes file's filename.

Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file.
attributeFile: The filename of the attribute file.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.